/*
############################################ ЗАДАНИЕ ###########################################
	Бинарное дерево
	Добавить в класс "Бинарное дерево" следующие
методы:
	* сохранение данных дерева в файл
void Save(Elem * Node, FILE*f);
	* загрузка данных из файла
void Load(Elem * Node, FILE*f);
	* балансировка бинарного дерева
void Вalancing();
################################################################################################
2,28,30 начало
*/

#include <iostream>

int main()
{

}